# coding=utf-8
'''Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...Количество элементов (n) вводится с клавиатуры'''
n = int(input('Введите количество элементов: '))
temp = 1
summ = 1
for i in range(1, n):
    temp = temp * (-1) / 2
    summ += temp
print(summ)
