'''В программе генерируется случайное целое число от 0 до 100. Пользователь должен его отгадать не более чем за 10 попыток.
 После каждой неудачной попытки должно сообщаться, больше или меньше загаданного введенное пользователем число.
  Если за 10 попыток число не отгадано, то вывести его'''
import random
from random import randint

c = random.randint(0, 100)
i = 10
while i > 0:
    ans = int(input('Ваш вариант?: '))
    if ans > c:
        print('Загаданное число меньше')
    elif ans < c:
        print('Загаданное число больше')
    else:
        print('Вы отгадали!!!')
        break
    if i == 1:
        print('Вы не отгадали, правильный ответ {}:'.format(c))
    i -= 1
