# coding=utf-8
'''Посчитать, сколько раз встречается определенная цифра в введенной последовательности чисел.
Количество вводимых чисел и цифра, которую необходимо посчитать, задаются вводом с клавиатуры'''
'''Матем'''
a = int(input('Введите последовательность чисел:'))

trg = int(input('Введите число которое необходимо посчитать:'))
tmp_trg = trg
disc = 10
count = 0
tmp_trg //= 10

while tmp_trg > 0:
    tmp_trg //= 10
    disc *= 10

while a > 0:
    if a % disc == trg:
        count += 1
    a //= disc
print('Количество знаков {} равно {}'.format(trg, count))

'''по питоньи'''
a = str(input('Введите последовательность чисел: '))
trg = str(input('Введите число которое необходимо посчитать: '))

print('Количество знаков {} равно {}'.format(trg, a.count(trg)))
